In [1]:
import sqlalchemy

%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

집계함수에서 NULL값은 제외한다는 것을 잊지 말자  
-> 이로 인해 금액의 오류가 상당히 많이 날 수 있음!!
# 최대값 출력하기(MAX)

최대 월급을 출력하시오

In [2]:
%%sql

select max(sal) "최대 월급"
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(5000,)]

문제 112. 직업이 SALESMAN'인 사원들의 최대월급을 출력하시오!

In [3]:
%%sql

select max(sal)"최대월급"
    from emp
    where job = 'SALESMAN'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(1600,)]

문제 113. 우리반에서 최소 나이 학생의 나이를 출력하시오

In [4]:
%%sql

select min(age)
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(24,)]

문제 114. 통신사가 sk인 학생들 중에서 최대 나이인 학생의 나이를 출력하시오

In [5]:
%%sql

select max(age)
    from emp12
    where regexp_like(lower(telecom), '[sk]+')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(36,)]

문제 115. 30번 부서번호의 최대 월급을 출력하시오

In [6]:
%%sql

select max(sal)
    from emp
    where regexp_like(deptno, '30')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(2850,)]

In [7]:
%%sql

select max(sal)
    from emp
    where deptno = 30

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(2850,)]

30번의 부서번호를 가진 사람의 부서번호와 최대 월급을 출력하시오

In [8]:
%%sql

select deptno, max(sal)
    from emp
    where deptno = 30
    group by deptno

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(30, 2850)]

![image](https://user-images.githubusercontent.com/70187490/126290206-53563359-8f2c-440f-99eb-c7b57aaefb41.png)

* group by deptno를 하면 여러 개 나오려는 deptno를 grouping 해준다.

문제 116. 직업, 직업별 최대월급을 출력하는데
             직업이 'SALESMAN'만 출력하시오!

In [9]:
%%sql

select job, max(sal)
    from emp
    where regexp_like(job, 'SALES+')
    group by job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SALESMAN', 1600)]

문제 117. 직업이 'ANALYST'인 사원들의 최대월급을 출력하시오

In [10]:
%%sql

select max(sal), job
    from emp
    where job='ANALYST'
    group by job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(3000, 'ANALYST')]

문제 118. 직업, 직업별 최대월급을 출력하시오

In [11]:
%%sql

select job, max(sal)
    from emp
    where job is not null
    group by job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SALESMAN', 1600),
 ('CLERK', 1300),
 ('ANALYST', 3000),
 ('MANAGER', 2975),
 ('PRESIDENT', 5000)]


문제 119. 위의 결과를 다시 출력하는데 직업별 최대월급이 높은 것 부터 출력하시오.

In [12]:
%%sql

select job, max(sal)
    from emp
    where job is not null
    group by job
    order by max(sal) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('PRESIDENT', 5000),
 ('ANALYST', 3000),
 ('MANAGER', 2975),
 ('SALESMAN', 1600),
 ('CLERK', 1300)]

문제 120. 부서번호, 부서번호별 최대월급을 출력하는데
             부서번호별 최대월급이 높은 것 부터 출력하시오

In [13]:
%%sql

select deptno, max(sal)
    from emp
    where job is not null
    group by deptno
    order by max(sal) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 5000), (20, 3000), (30, 2850)]

In [14]:
%%sql

select deptno, max(sal)
    from emp
    group by deptno
    order by max(sal) desc nulls last

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 5000), (20, 3000), (30, 2850), (None, None)]

★ to_char를 이용해서 숫자를 문자로 형변환하기  
select sal, to_char(sal, '999,999') ---> 은행권에서는 무조건 해줘야 함  

<br>

- to_char(sal, '999,999')의 의미는 sal 숫자를 문자로 출력하는데  
    - to_char(숫자형 컬럼, '문자포맷')의 문법에 따라 문자 포맷에 맞는 문자로 출력하는 것
    - 9는 자릿수를 의미하고 이 자리에 0~9 사이의 숫자중에 어떤 숫자든 관계는 없지만 자릿수는 한자리여야 한다는 의미
    - 자릿수 형식이 있어야 하는 숫자를 출력해야 할 때 쓰임
   
    
문제 121. 이름과 연봉(월급 x 12)를 출력하는데 연봉을 출력할 때 천 단위와 백만 단위가 표시되게 하시오

In [15]:
%%sql

select ename as "이름", to_char(sal *12, '9,999,999') as "최대 월급"
    from emp
    where sal is not null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', '    60,000'),
 ('BLAKE', '    34,200'),
 ('CLARK', '    29,400'),
 ('JONES', '    35,700'),
 ('MARTIN', '    15,000'),
 ('ALLEN', '    19,200'),
 ('TURNER', '    18,000'),
 ('JAMES', '    11,400'),
 ('WARD', '    15,000'),
 ('FORD', '    36,000'),
 ('SMITH', '     9,600'),
 ('SCOTT', '    36,000'),
 ('ADAMS', '    13,200'),
 ('MILLER', '    15,600')]


문제 123. 직업과 직업별 최대월급을 출력하는데 
             직업별 최대월급을 출력할때 천단위 콤마가 출력되게 하시오

In [16]:
%%sql

select job as "직업", to_char(max(sal), '9,999') as "최대 월급"
    from emp
    where job is not null
    group by job
    order by max(sal) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('PRESIDENT', ' 5,000'),
 ('ANALYST', ' 3,000'),
 ('MANAGER', ' 2,975'),
 ('SALESMAN', ' 1,600'),
 ('CLERK', ' 1,300')]

오답:
- to_char(sal, '9,999')는 문자로 변환됨
- max(문자)는 아스키 코드 값의 최대값을 뽑아냄
- order by max(to_char(sal, '9,999'))는 아스키 코드값의 최대값대로 순서대로 정렬하기 때문에 위험함

In [17]:
%%sql

select job as "직업", to_char(max(sal), '9,999') as "최대 월급"
    from emp
    where job is not null
    group by job
    order by max(to_char(sal, '9,999')) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('PRESIDENT', ' 5,000'),
 ('ANALYST', ' 3,000'),
 ('MANAGER', ' 2,975'),
 ('SALESMAN', ' 1,600'),
 ('CLERK', ' 1,300')]

문제 124. 직업, 직업별 최소월급을 출력하시오

In [18]:
%%sql

select job, min(sal)
    from emp
    where job is not null
    group by job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SALESMAN', 1250),
 ('CLERK', 800),
 ('ANALYST', 3000),
 ('MANAGER', 2450),
 ('PRESIDENT', 5000)]

문제 125. 위의 결과를 다시 출력하는데 직업이 ABCD 순서대로 출력되게 하시오!

In [19]:
%%sql

select job, min(sal)
    from emp
    where job is not null
    group by job
    order by min(sal) asc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('CLERK', 800),
 ('SALESMAN', 1250),
 ('MANAGER', 2450),
 ('ANALYST', 3000),
 ('PRESIDENT', 5000)]

문제 126. 위의 결과에서 직업이 SALESMAN은 제외하고 출력하시오

In [20]:
%%sql

select job, min(sal)
    from emp
    where job != 'SALESMAN'
    group by job
    order by min(sal) asc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('CLERK', 800), ('MANAGER', 2450), ('ANALYST', 3000), ('PRESIDENT', 5000)]

# 최소값 출력하기(MIN)

문제 127. 우리반에서 최소나이를 출력하시오

In [21]:
%%sql

select min(age)
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(24,)]

문제 128. 서울에서 사는 학생 중에 최소 나이를 출력하시오

In [22]:
%%sql

select min(age)
    from emp12
    where regexp_like(address, '서울')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(26,)]

문제 129. 입사한 년도(4자리)를 출력하고 입사한 년도별 최소월급을 출력하시오

In [23]:
%%sql

select to_char(hiredate,'YYYY') as "입사년도", min(sal) as "입사년도별 최소월급"
    from emp
    group by to_char(hiredate,'YYYY')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('1981', 950), ('1983', 1100), ('1982', 1300), ('1980', 800)]

select 절과 group by 절을 동일하게 맞춰줘야 한다

# 평균값 출력하기(AVG)
문제 130. 우리반 나이의 평균을 출력하시오

In [24]:
%%sql

select round(avg(age),0) as "평균 나이"
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(29,)]

문제 131. 사원 테이블의 월급의 평균값을 출력하시오

In [25]:
%%sql

select round(avg(sal), 2)
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(Decimal('2073.21'),)]

문제 132. 커미션의 평균값을 출력하시오

In [26]:
%%sql

select avg(comm)
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(550,)]

문제 133. 위의 결과를 다시 출력하는데 4로 나누지 않고 14로 나누게 하시오!

In [27]:
%%sql

select avg(nvl(comm,0))
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(Decimal('146.666666666666666666666666666666666667'),)]

"그룹함수는 null값을 무사함"  
-> 이로 인해 금액의 오류가 상당히 많이 날 수 있음

문제 135. 직업, 직업별 평균 월급을 출력하시오!

In [28]:
%%sql

select job, round(avg(nvl(sal,0)))
    from emp
    group by job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SALESMAN', 1400),
 ('CLERK', 1038),
 ('ANALYST', 3000),
 ('MANAGER', 2758),
 (None, 0),
 ('PRESIDENT', 5000)]

문제 136. 통신사, 통신사별 평균나이를 출력하시오

In [29]:
%%sql

select substr(upper(telecom), 1, 2) as "통신사", round(avg(age)) as "평균 나이"
    from emp12
    group by substr(upper(telecom), 1, 2)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KT', 27), ('SK', 29), ('LG', 32)]

In [30]:
%%sql

select decode(upper(telecom), 'SKT', 'SK', upper(telecom)) as "통신사",
       round(avg(age)) as "평균나이"
    from emp12
    group by decode(upper(telecom), 'SKT', 'SK', upper(telecom))

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KT', 27), ('SK', 29), ('LG', 32)]

문제 137. 전공, 전공별 평균나이를 출력하는데 
             전공이 ㄱ,ㄴ, ㄷ, ㄹ 순으로 출력되게 하시오!

In [31]:
%%sql

select trim(major), avg(age)
    from emp12
    group by trim(major)
    order by trim(major) asc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('경영학과', 28),
 ('경제학과', 34),
 ('관광경영학과', 35),
 ('광고학과', 27),
 ('국문학과', 28),
 ('국제통상학과', 33),
 ('금융학과', 27),
 ('마케팅학과', 30),
 ('메카트로닉스과', 28),
 ('병원행정학과', 27),
 ('사회학과', 26),
 ('수학통계학과', 28),
 ('영어영문학과', 29),
 ('요리학과', 36),
 ('음악학과', 25),
 ('응용통계학과', 28),
 ('전자공학과', 24),
 ('정보통계학과', 29),
 ('컨벤션경영학과', 27),
 ('통게학과', 26),
 ('통계학과', Decimal('25.5')),
 ('호텔조리학과', 24)]


문제 138. 직업, 직업별 토탈월급을 출력하는데
              직업별 토탈 급이 높은 것 부터 출력하시오

In [32]:
%%sql

select job, sum(nvl(sal, 0))
    from emp
    where job is not null
    group by job
    order by sum(nvl(sal, 0)) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('MANAGER', 8275),
 ('ANALYST', 6000),
 ('SALESMAN', 5600),
 ('PRESIDENT', 5000),
 ('CLERK', 4150)]

문제 139. 위의 결과에서 직업이 SALESMAN은 제외하고 출력하시오

In [33]:
%%sql

select job, sum(nvl(sal, 0))
    from emp
    where job is not null and
          job != 'SALESMAN'
    group by job
    order by sum(nvl(sal, 0)) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('MANAGER', 8275), ('ANALYST', 6000), ('PRESIDENT', 5000), ('CLERK', 4150)]


문제 140. 위의 결과를 다시 출력하는데 
             토탈 월급이 6000 이상인 것만 출력하시오

In [34]:
%%sql

select job, sum(nvl(sal, 0))
    from emp
    where job is not null and
          job != 'SALESMAN'
    having sum(nvl(sal, 0)) >= 6000
    group by job
    order by sum(nvl(sal, 0)) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('MANAGER', 8275), ('ANALYST', 6000)]

- group 함수로 조건을 줄때는 where 절에 사용하면 안되고 having 절에 사용해야 함
- where 절에는 그룹함수를 사용하지 않는 일반적인 검색 조건을 줄때 사용함

<br>

- select문의 6가지 절  
코딩 순서: select --> from --> where --> group by --> having --> order by  
실행 순서: from --> where --> group by --> having --> select --> order by  

|실행순서|타이핑 순서|의미|
|:-:|:-|:-|
|5|select|검색할 컬럼명|
|1|from|검색할 테이블명|
|2|where|검색 조건|
|3|group by|그룹핑할 컬럼|
|4|having|그룹함수로 검색조건을 줄 때 사용|
|6|order by|정렬할 컬럼명|

![image](https://user-images.githubusercontent.com/70187490/126613304-e1b3a309-d368-462a-aad0-9ecd15709ece.png)

문제 141. 직업, 직업별 토탈 월급을 출력하는데   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;직업이 SALESMAN은 제외하고 출력하고  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;직업별 토탈 월급이 6000이상인 것만 출력하고  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;직업별 토탈 월급이 높은 것부터 출력하시오

In [38]:
%%sql

select job,sum(nvl(sal, 0))
    from emp
    where job != 'SALESMAN'
    group by job
    having sum(nvl(sal, 0)) >= 6000
    order by sum(nvl(sal, 0))

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 6000), ('MANAGER', 8275)]

- 밑의 SQL이 수행되지만 검색속도가 느려짐
    - 일반적인 검색조건을 having절에 사용하면 검색속도가 느려지므로 반드시 where 절에 작성해야 함

In [40]:
%%sql

select job, sum(sal)
    from emp
    group by job
    having sum(sal) >= 6000 and job != 'SALESMAN'
    order by sum(sal) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('MANAGER', 8275), ('ANALYST', 6000)]

문제 142. 통신사, 통신사별 토탈 나이를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;skt는 제외하고 출력하고   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;통신사별 토탈나이가 100살 이상인 데이터만 출력하고   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;통신사별 토탈나이가 높은 것부터 출력하시오

In [64]:
%%sql

select telecom, sum(age)
    from emp12
    where telecom != 'skt'
    group by telecom
    having sum(age) >= 100
    order by sum(age) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('kt', 354), ('sk', 204), ('lg', 126)]

문제 143. 위의 문제를 다시 푸는데 이번에는 skt를 sk에 포함시켜서 출력하시오

In [69]:
%%sql
select decode(lower(telecom), 'skt','sk', lower(telecom)) "통신사", sum(age) "합계 나이"
    from emp12
    group by decode(lower(telecom), 'skt','sk', lower(telecom))
    having sum(age) >= 100
    order by 2 desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('kt', 381), ('sk', 294), ('lg', 126)]

문제 144. 입사한 년도 (4자리), 입사한 년도별 토탈월급을 출력하는데  
             토탈월급을 출력할 때 천만원 표시가 출력되게 하시오!

In [77]:
%%sql

select to_char(hiredate,'YYYY') as "입사년도", to_char(sum(sal), '999,999') as "총 월급"
    from emp
    group by to_char(hiredate,'YYYY')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('1981', '  22,825'),
 ('1983', '   1,100'),
 ('1982', '   4,300'),
 ('1980', '     800')]

# 건수 출력하기(COUNT)

In [78]:
%%sql
select count(empno)
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(15,)]


문제 145. 직업, 직업별 인원수를 출력하시오

In [82]:
%%sql

select job, count(*)
    from emp
    group by job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SALESMAN', 4),
 ('CLERK', 4),
 ('ANALYST', 2),
 ('MANAGER', 3),
 (None, 1),
 ('PRESIDENT', 1)]

문제 146. 나이, 나이별 인원수를 출력하시오!

In [84]:
%%sql

select age, count(*)
    from emp12
    group by age

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(27, 6),
 (31, 1),
 (36, 1),
 (44, 1),
 (30, 1),
 (35, 1),
 (28, 4),
 (26, 4),
 (33, 1),
 (29, 4),
 (25, 2),
 (24, 2)]

문제 147. 위의 결과를 다시 출력하는데 나이별 인원수가 높은 것 부터 출력하시오

In [85]:
%%sql

select age, count(*)
    from emp12
    group by age
    order by count(*) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(27, 6),
 (29, 4),
 (26, 4),
 (28, 4),
 (25, 2),
 (24, 2),
 (33, 1),
 (30, 1),
 (44, 1),
 (36, 1),
 (31, 1),
 (35, 1)]

문제 148. 위의 결과를 다시 출력하는데 나이별 인원수가 2명 이상인 것만 출력하시오

In [91]:
%%sql

select age, count(*)
    from emp12
    group by age
    having count(*) >=2
    order by count(*) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(27, 6), (28, 4), (26, 4), (29, 4), (25, 2), (24, 2)]

문제 149. 통신사, 통신사별 인원수를 출력하시오!

In [94]:
%%sql

select decode(lower(telecom), 'skt', 'sk', lower(telecom)) as "통신사", count(*) as "인원수"
    from emp12 
    group by decode(lower(telecom), 'skt', 'sk', lower(telecom))

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('sk', 10), ('lg', 4), ('kt', 14)]

문제 150. 이메일 도메인, 이메일 도메인별 인원수를 출력하시오!

In [105]:
%%sql

select substr(email, instr(email, '@')+1, instr(email,'.',-1,1) -instr(email,'@')-1) as "도메인",
       count(*)
    from emp12
    group by substr(email, instr(email, '@')+1, instr(email,'.',-1,1) -instr(email,'@')-1)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('naver', 18), ('yahoo', 1), ('hanmail', 1), (None, 1), ('gmail', 7)]

문제 152. 주소, 주소별 인원수를 아래와 같이 출력하시오  
서울시 19  
강원도 1

In [132]:
%%sql

select decode(substr(ltrim(address),1, 3),'서울 ','서울시',substr(ltrim(address),1, 3)) as "주소", 
       count(*) as "인원수"
    from emp12
    group by decode(substr(ltrim(address),1, 3),'서울 ','서울시',substr(ltrim(address),1, 3))

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('강원도', 1), ('서울시', 10), ('경기도', 17)]